tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "nats-io/nats-tools"
tap "snowflakedb/snowflake-cli"
brew "openssl@3"
brew "python@3.13"
brew "awscli"
brew "bat"
brew "btop"
brew "cheat"
brew "cmatrix"
brew "cowsay"
brew "docker"
brew "eza"
brew "fd"
brew "figlet"
brew "fortune"
brew "fzf"
brew "gh"
brew "git-delta"
brew "go"
brew "golangci-lint"
brew "grc"
brew "httpie"
brew "jp2a"
brew "jq"
brew "lazygit"
brew "locust"
brew "lolcat"
brew "luarocks"
brew "lynx"
brew "make"
brew "nats-server"
brew "neovim"
brew "node"
brew "ollama"
brew "p7zip"
brew "php"
brew "poppler"
brew "procs"
brew "ripgrep"
brew "snowflake-cli"
brew "starship"
brew "stow"
brew "task"
brew "terminal-notifier"
brew "terraform"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "w3m"
brew "wget"
brew "xclip"
brew "yarn"
brew "yazi"
brew "zoxide"
brew "felixkratz/formulae/borders"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "nats-io/nats-tools/nats"
brew "nats-io/nats-tools/nsc"
cask "adobe-acrobat-reader"
cask "arc"
cask "bitwarden"
cask "ghostty"
cask "gimp"
cask "github"
cask "gitkraken"
cask "jetbrains-toolbox"
cask "kdiff3"
cask "marta"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "obsidian"
cask "pastebot"
cask "postman"
cask "rectangle"
cask "snowflake-snowsql"
cask "soapui"
cask "spotify"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "golang.org/x/tools/gopls"
go "github.com/securego/gosec/v2/cmd/gosec"
go "honnef.co/go/tools/cmd/staticcheck"
