tap "arimxyer/tap", trusted: true
tap "charmbracelet/tap", trusted: true
tap "felixkratz/formulae", trusted: true
tap "gromgit/brewtils", trusted: true
tap "hashicorp/tap", trusted: true
tap "homebrew/bundle"
tap "jesseduffield/lazygit", trusted: true
tap "jhlee0409/tap"
tap "koekeishiya/formulae", trusted: true
tap "nats-io/nats-tools", trusted: true
tap "snowflakedb/snowflake-cli", trusted: true
tap "transactrx/tap", trusted: true
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Securely store and access AWS credentials in development environments
brew "aws-vault"
# Official Amazon AWS command-line interface
brew "awscli"
# Simple command-line tool to read AWS CloudWatch logs
brew "awslogs"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# Console Matrix
brew "cmatrix"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# Command-line csv viewer
brew "csvlens"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# More intuitive version of du in rust
brew "dust"
# Run arbitrary commands when files change
brew "entr"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Render markdown on the CLI
brew "glow"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Colorize logfiles and command output
brew "grc"
# Tool for glamorous shell scripts
brew "gum"
# Fast and powerful log viewer and processor
brew "hl"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Logs for humans to read
brew "humanlog"
# Convert JPG images to ASCII
brew "jp2a"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Find what models run on your hardware
brew "llmfit"
# Scalable user load testing tool written in Python
brew "locust"
# Rainbows and unicorns in your console!
brew "lolcat"
# Package manager for the Lua programming language
brew "luarocks"
# Text-based web browser
brew "lynx"
# Apple Silicon Monitor Top written in Go Lang
brew "mactop"
# Utility for directing compilation
brew "make"
# Drop-in replacement for MySQL
brew "mariadb"
# Lightweight cloud messaging system
brew "nats-server"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Terminal multiplexer
brew "tmux"
# Process manager for Procfile-based applications and tmux
brew "overmind"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# General-purpose scripting language
brew "php"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Modern replacement for ps written in Rust
brew "procs"
# File browser
brew "ranger"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# CLI for snowflake
brew "snowflake-cli"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Feature-rich console based todo list manager
brew "task"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Programmatically correct mistyped console commands
brew "thefuck"
# Simplified and community-driven man pages
brew "tldr"
# Color-based alternative to figlet (uses libcaca)
brew "toilet"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Pager/text based browser
brew "w3m"
# Internet file retriever
brew "wget"
# Access X11 clipboards from the command-line
brew "xclip"
# JavaScript package manager
brew "yarn"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# A fast TUI and CLI for browsing AI models, benchmarks, and coding agents
brew "arimxyer/tap/models"
# A powerful terminal-based AI assistant for developers, providing intelligent coding assistance directly in your terminal.
brew "charmbracelet/tap/crush"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Interactive TUI for Homebrew
brew "gromgit/brewtils/taproom"
# Terraform
brew "hashicorp/tap/terraform"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# NATS utility
brew "nats-io/nats-tools/nats"
# A tool for creating NATS account and user access configurations
brew "nats-io/nats-tools/nsc"
# CLI tool to discover NATS services using the nats-service framework
brew "transactrx/tap/nats-discover"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# Chromium based browser
cask "arc"
# Desktop password and login vault
cask "bitwarden"
# Browse and analyze Claude Code conversation history offline
cask "jhlee0409/tap/claude-code-history-viewer", trusted: true
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source image editor
cask "gimp"
# Desktop client for GitHub repositories
cask "github"
# Git client focusing on productivity
cask "gitkraken"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Utility for comparing and merging files and directories
cask "kdiff3"
# Extensible two-pane file manager
cask "marta"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Office suite
cask "microsoft-office"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Workflow application to improve productivity
cask "pastebot"
# Collaboration platform for API development
cask "postman"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Command-line client for connecting to Snowflake
cask "snowflake-snowsql"
# API testing tool
cask "soapui"
# Music streaming service
cask "spotify"
vscode "aaron-bond.better-comments"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "alexcvzz.vscode-sqlite"
vscode "alexdima.copy-relative-path"
vscode "aykutsarac.jsoncrack-vscode"
vscode "bierner.markdown-yaml-preamble"
vscode "castwide.solargraph"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "chrmarti.regex"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dgerrard.stuck-overflow"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "emilast.logfilehighlighter"
vscode "eriklynd.json-tools"
vscode "esbenp.prettier-vscode"
vscode "fchieze.terraformer"
vscode "file-icons.file-icons"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "github.codespaces"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "groksrc.ruby"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "hilleer.yaml-plus-json"
vscode "hridoy.rails-snippets"
vscode "humao.rest-client"
vscode "jasonnutter.search-node-modules"
vscode "jaspernorth.vscode-pigments"
vscode "jkillian.custom-local-formatters"
vscode "johnpapa.vscode-peacock"
vscode "kamikillerto.vscode-colorize"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azureterraform"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.atom-keybindings"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.powershell"
vscode "naumovs.color-highlight"
vscode "oderwat.indent-rainbow"
vscode "phplasma.csv-to-table"
vscode "pnp.polacode"
vscode "pranaygp.vscode-css-peek"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "sh17ck.vscode-xsd-treeview"
vscode "streetsidesoftware.code-spell-checker"
vscode "techer.open-in-browser"
vscode "tyriar.sort-lines"
vscode "volcanicbytes.xsd-navigator"
vscode "vortizhe.simple-ruby-erb"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "wayou.vscode-todo-highlight"
vscode "xabikos.javascriptsnippets"
vscode "yzhang.markdown-all-in-one"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "golang.org/x/tools/gopls"
go "github.com/securego/gosec/v2/cmd/gosec"
go "honnef.co/go/tools/cmd/staticcheck"
npm "@anthropic-ai/claude-code"
npm "ansi"
npm "neovim"
